alert("Для просмотра данных, войдите в консоль.");
var arr = new Array();
var N = new Array("Устинов Евгений Сергеевич","Елисеев Никита Фёдорович","Щербаков Милан Андреевич",
	"Волков Остап Романович","Евдокимов Карен Романович","Копылов Матвей Александрович",
	"Архипов Гордей Иванович","Авдеев Ефим Андреевич","Носков Добрыня Александрович","Евсеев Стефан Фёдорович",
	"Савельева Инесса Ивановна","Одинцова Инесса Сергеевна","Абрамова Елена Александровна","Федосеева Анжелика Романовна",
	"Сорокина Людмила Владимировна","Осипова Анастасия Владимировна","Кудрявцева Маргарита Сергеевна","Степанова Варвара Ивановна",
	"Брагина Федосья Сергеевна","Денисова Нонна Фёдоровна");
var M = new Array("Геленджик","Саранск","Якутск","Каменск-Шахтинский","Смоленск","Междуреченск","Ступино","Вольск","Люберцы","Псков","Белорецк","Александров","Асбест",
	"Искитим","Котлас","Набережные Челны","Заречный","Анапа","Каменск-Уральский","Воркута");
for(var i in N){
	arr[i]={
		FIO: N[i],
		AGE: Math.round(Math.random()*(70) + 20),
		STRANA: M[Math.round(Math.random()*M.length)],
		print: function(){
			console.log("ФИО: "+this.FIO+", город: "+this.STRANA+", "+this.AGE+" лет");
		}
	}
}
sortirovka=arr.sort(function(first,second){
	return first.AGE< second.AGE ? 1 : -1;
})
console.log("Люди отсортированы по убыванию: ");
for (var i in sortirovka){
	sortirovka[i].print();
}
